# GUIDIsValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SchemaBuilder..::..GUIDIsValid Method
SchemaBuilder Class See Also
---
Checks whether the supplied GUID value is valid.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool GUIDIsValid(
	Guid guid
)
```

Visual Basic
---
```text
Public Shared Function GUIDIsValid ( _
	guid As Guid _
) As Boolean
```

Visual C++
---
```text
public:
static bool GUIDIsValid(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..Guid The GUID to check
# ### Return Value
True if the GUID is valid
# See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace